In [1]:
import pandas as pd


df = pd.DataFrame({
    'Nombre': ['Ana', 'Luis', 'Carmen'],
    'Edad': [25, 30, 22],
    'Ciudad': ['Madrid', 'Barcelona', 'Valencia']
}, index=['fila1', 'fila2', 'fila3'])

In [2]:
df

       Nombre  Edad     Ciudad
fila1     Ana    25     Madrid
fila2    Luis    30  Barcelona
fila3  Carmen    22   Valencia

In [5]:
df.loc[["fila1","fila3"]]

       Nombre  Edad    Ciudad
fila1     Ana    25    Madrid
fila3  Carmen    22  Valencia

In [8]:
df.loc["fila2":"fila3"]

       Nombre  Edad     Ciudad
fila2    Luis    30  Barcelona
fila3  Carmen    22   Valencia

In [9]:
df.loc[[False,True, False]]

      Nombre  Edad     Ciudad
fila2   Luis    30  Barcelona

In [10]:
df.loc[df["Edad"] > 25 ]

      Nombre  Edad     Ciudad
fila2   Luis    30  Barcelona

In [11]:
df.loc[:,["Nombre","Edad"]]

       Nombre  Edad
fila1     Ana    25
fila2    Luis    30
fila3  Carmen    22

# iloc va amb posicions numericas i no amb labels

In [12]:
df.iloc[0]

Nombre       Ana
Edad          25
Ciudad    Madrid
Name: fila1, dtype: object

In [13]:
df.iloc[:,[1,2]]

       Edad     Ciudad
fila1    25     Madrid
fila2    30  Barcelona
fila3    22   Valencia

In [19]:
df.iloc[:,[1,2]]

       Edad     Ciudad
fila1    25     Madrid
fila2    30  Barcelona
fila3    22   Valencia